Repository: cdemu/cdemu
Catalog: libmirage/po/*.po
Languages: ka

source: Invalid CSO file!
ka: არასწორი CSO ფაილი!

source: No parts in CSO file!
ka: CSO ფაილში ნაწილები არაა!

source: Failed to allocate memory for index!
ka: ინდექსისთვის მეხსიერების გამოყოფა ჩავარდა!

source: Failed to seek to the beginning of index!
ka: ინდექსის დასაწყისში გადახვევა ჩავარდა!

source: Failed to read from index!
ka: ინდექსიდან წაკითხვა ჩავარდა!

source: Failed to initialize zlib's inflate (error: %d)!
ka: zlib-ის გაბერვის ინიციალიზაციის შეცდომა (შეცდომა: %d)!

source: Failed to allocate memory for inflate buffer!
ka: გაბერვის ბუფერისთვის მეხსიერების გამოყოფის შეცდომა!

source: Failed to allocate memory for I/O buffer!
ka: შეტანა/გამოტანის ბუფერისთვის მეხსიერების გამოყოფა ჩავარდა!

source: Filter cannot handle given data: failed to read CISO header!
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: CISO თავსართის წაკითხვა ჩავარდა!

source: Filter cannot handle given data: invalid header!
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: არასწორი თავსართი!

source: CSO File Filter
ka: CSO ფაილის ფილტრი

source: Compressed ISO images (*.ciso, *.cso)
ka: შეკუმშული ISO ასლის ფაილი (*.ciso, *.cso)

source: Compressed ISO image file
ka: შეკუმშული ISO ასლის ფაილი

source: Failed to read main file's header!
ka: მთავარი ფაილის თავსართის წაკითხვა ჩავარდა!

source: CRC32 checksum mismatch!
ka: CRC32 საკონტროლო ჯამი არ ემთხვევა!

source: Failed to read part file's header!
ka: ნაწილი ფაილის თავსართის წაკითხვა ჩავარდა!

source: Failed to find part for offset %s!
ka: შეუძლებელია ნაწილის პოვნა წანაცვლებისთვის %s!

source: Failed to seek to %s!
ka: %s-ზე გადახვევა ჩავარდა!

source: Failed to read 0x%X bytes!
ka: 0x%X ბაიტის წაკითხვა ჩავარდა!

source: Failed to read descriptor data!
ka: დესკრიპტორის მონაცემების წაკითხვა ჩავარდა!

source: Invalid filename format type!
ka: არასწორი ფაილის სახელის ფორმატის ტიპი!

source: Invalid size for encryption descriptor!
ka: დაშიფვრის დესკრიპტორის ზომა არასწორია!

source: Image is encrypted!
ka: ასლის ფაილი დაშიფრულია!

source: Incorrect password!
ka: არასწორი პაროლი!

source: Failed to read descriptor type!
ka: დესკრიპტორის ტიპის წაკითხვის შეცდომა!

source: Failed to allocate chunk table buffer (%d bytes)!
ka: ფრაგმენტების ცხრილის ბუფერის გამოყოფის შეცდომა (%d ბაიტი)!

source: Failed to read chunk table data!
ka: ფრაგმენტების ცხრილის მონაცემების წაკითხვა ჩავარდა!

source: Failed to allocate chunk table (%s bytes)!
ka: ფრაგმენტების ცხრილის გამოყოფის შეცდომა (%s ბაიტი)!

source: Failed to allocate I/O buffer size (%d bytes)!
ka: შეტანა/გამოტანის ბუფერის ზომის გამოყოფა ჩავარდა (%d ბაიტი)!

source: Failed to allocate part table!
ka: ნაწილების ცხრილის გამოყოფა შეუძლებელია!

source: Failed to read part's signature!
ka: ნაწილის ხელმოწერის წაკითხვა შეუძლებელია!

source: Part's signature is invalid!
ka: ნაწილის ხელმოწერა შეუძლებელია!

source: Compressed chunk table not supported yet!
ka: შეკუმშული ფრაგმენტების ცხრილი ჯერ მხარდაჭერილი არაა!

source: Bit swap type %d not supported yet!
ka: ბიტების მიმოცვლის ტიპი %d ჯერ მხარდაჭერილი არაა!

source: Unsupported format: 0x%X!
ka: მხარდაუჭერელი ფორმატი: 0x%X!

source: Failed to allocate inflate buffer (%d bytes)!
ka: გაბერვის ბუფერის გამოყოფა ჩავარდა (%d ბაიტი)!

source: Filter cannot handle given data: failed to read 16-byte signature!
ka: ფილტრს მითითებული მონაცემების დამუშავება არ შეუძლია: 16-ბიტიანი ხელმოწერის წაკითხვის შეცდომა!

source: Filter cannot handle given data: invalid signature!
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: არასწორი ხელმოწერა!

source: DAA File Filter
ka: DAA ფაილის ფილტრი

source: PowerISO images (*.daa)
ka: PowerISO ასლის ფაილები (*.daa)

source: gBurner images (*.gbi)
ka: gBurner ასლის ფაილები (*.gbi)

source: PowerISO image file
ka: PowerISO ასლის ფაილი

source: gBurner image file
ka: gBurner ასლის ფაილი

source: Failed to allocate memory!
ka: მეხსიერების გამოყოფის შეცდომა!

source: Failed to read XML resource-fork!
ka: XML რესურსის შტოს წაკითხვა ჩავარდა!

source: Failed to read binary resource-fork!
ka: ბინარული რესურსის შტოს წაკითხვა ჩავარდა!

source: Image lacks either an XML or a binary descriptor!
ka: ასლის ფაილს, ან XML, ან ბინარული დესკრიპტორი აკლია!

source: Failed to parse resource-fork!
ka: რესურსების რტოს დამუშავება ჩავარდა!

source: Encountered unknown block type: %d!
ka: შემხვდა უცნობი ბლოკის ტიპი: %d!

source: Failed to find required 'blkx' type!
ka: აუცილებელი ტიპის 'blkx' აღმოჩენის შეცდომა!

source: Failed to initialize libbz2's decompress (error: %d)!
ka: libbz2-ის დეკომპრესიის ინიციალიზაცია ჩავარდა (შეცდომა: %d)!

source: Failed to allocate memory for streams!
ka: ნაკადებისთვის მეხსიერების გამოყოფის შეცდომა!

source: Failed to create stream!
ka: ნაკადის შექმნის შეცდომა!

source: Failed to reallocate memory for koly blocks!
ka: koly-ის ბლოკებისთვის მეხსიერების ხელახლა გამოყოფის შეცდომა!

source: Failed to read koly block!
ka: koly-ის ბლოკის წაკითხვის შეცდომა!

source: Invalid koly block!
ka: არასწორი koly-ის ბლოკი!

source: Failed to allocate memory for koly block!
ka: koly-ის ბლოკისთვის მეხსიერების გამოყოფის შეცდომა!

source: Filter stream cannot handle given image: failed to read koly block!
ka: ფილტრის ნაკადს მოწოდებული ასლის ფაილის დამუშავება არ შეუძლია: koly-ის ბლოკის წაკითხვა ჩავარდა!

source: Filter stream cannot handle given image: invalid koly block!
ka: ფილტრის ნაკადს მოწოდებული ასლის ფაილის დამუშავება არ შეუძლია: არასწორი koly-ის ბლოკი!

source: File is not the first file of a set!
ka: ფაილი ნაკრების პირველი ფაილი არაა!

source: Failed to open streams!
ka: ნაკადების გახსნის შეცდომა!

source: DMG File Filter
ka: DMG ფაილის ფილტრი

source: Apple Disk Image (*.dmg)
ka: Apple დისკის ასლის ფაილი (*.dmg)

source: Failed to allocate %d ECM parts!
ka: %d ECM ნაწილის გამოყოფა ჩავარდა!

source: Failed to seek behind signature!
ka: ხელმოწერის მიღმა გადახვევა ჩავარდა!

source: Failed to read a byte!
ka: ბაიტის წაკითხვა ჩავარდა!

source: Corrupted ECM file; invalid sector count!
ka: დაზიანებული ECM ფაილი. სექტორების რაოდენობა არასწორია!

source: Unhandled ECM part type %d!
ka: დაუმუშავებელი ECM ნაწილის ტიპი %d!

source: Failed to seek over ECM part data!
ka: ECM ნაწილის მონაცემებს მიღმა გადახვევა ჩავარდა!

source: No parts in ECM file!
ka: ECM ფაილში ნაწილები არაა!

source: Filter cannot handle given data: failed to read 4 signature bytes!
ka: ფილტრს მითითებული მონაცემების დამუშავება არ შეუძლია: ხელმოწერის 4 ბაიტის წაკითხვის შეცდომა!

source: ECM File Filter
ka: ECM ფაილის ფილტრი

source: ECM'ified images (*.ecm)
ka: გა-ECM-ებული ასლის ფაილები (*.ecm)

source: ECM'ified image file
ka: გა-ECM-ებული ასლის ფაილი

source: Failed to allocate part buffer (%d bytes)!
ka: ნაწილის ბუფერის გამოყოფა ჩავარდა (%d ბაიტი)!

source: Failed to allocate %d GZIP parts!
ka: %d GZIP ნაწილის გამოყოფა ჩავარდა!

source: Failed to allocate buffers!
ka: ბუფერების გამოყოფა ჩავარდა!

source: Failed to seek to the beginning of stream!
ka: ნაკადის დასაწყისში გადახვევა ჩავარდა!

source: Failed to read %d bytes from underlying stream!
ka: %d ბაიტის წაკითხვის შეცდომა ქვედა ნაკადიდან!

source: Unexpectedly reached EOF!
ka: მოულოდნელი EOF!

source: Failed to inflate!
ka: გაბერვა ჩავარდა!

source: No parts in GZIP file!
ka: GZIP ფაილში ნაწილები არაა!

source: GZIP File Filter
ka: GZIP ფაილის ფილტრი

source: gzip-compressed images (*.gz)
ka: gzip-ით შეკუმშული დისკის ასლის ფაილები (*.gz)

source: Failed to seek to the beginning of segment table!
ka: სეგმენტების ცხრილის დასაწყისში გადახვევის შეცდომა!

source: Failed to read segment!
ka: სეგმენტის წაკითხვს შეცდომა!

source: Failed to allocate memory for segment table!
ka: სეგმენტების ცხრილისთვის მეხსიერების გამოყოფის შეცდომა!

source: No parts in ISZ file!
ka: ISZ ფაილში ნაწილები არაა!

source: Failed to allocate memory for chunk table!
ka: ფრაგმენტების ცხრილისთვის მეხსიერების გამოყოფის შეცდომა!

source: Unsupported pointer length!
ka: მხარდაუჭერელი მაჩვენებლის სიგრძე!

source: Failed to allocate memory for chunk buffer!
ka: ფრაგმენტების ბუფერისთვის მეხსიერების გამოყოფის შეცდომა!

source: Failed to seek to the beginning of chunk table!
ka: ფრაგმენტების ცხრილის დასაწყისში გადახვევის შეცდომა!

source: Failed to read index!
ka: ინდექსის წაკითხვა ჩავარდა!

source: Filter cannot handle given data: failed to read ISZ header!
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: ISZ თავსართის წაკითხვა ჩავარდა!

source: Filter cannot handle given data: invalid ISZ header!
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: არასწორი ISZ თავსართი!

source: ISZ File Filter
ka: ISZ ფაილის ფილტრი

source: Compressed ISO images (*.isz)
ka: შეკუმშული ISO ასლის ფაილები (*.isz)

source: Filter cannot handle given data: failed to read MacBinary header!
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: MacBinary-ის თავსართის წაკითხვა ჩავარდა!

source: File validates as MacBinary v1.0, however the check is unreliable and therefore disabled!
ka: შესაძლებელია, ეს ფაილი წარმოადგენს MacBinary v1.0-ს. მაგრამ შემოწმება სანდო არა და ამიტომ გამორთულია!

source: Failed to read resource-fork!
ka: რესურსების შტოს წაკითხვა ჩავარდა!

source: KenCode decompression is not supported!
ka: KenCode-ის დეკომპრესია მხარდაჭერილი არაა!

source: Encountered unknown part type: %d!
ka: შემხვდა უცნობი ნაწილის ტიპი: %d!

source: Error allocating memory for buffers!
ka: ბუფერებისთვის მეხსიერების გამოყოფის შეცდომა!

source: NDIF data structures not found!
ka: NDIF მონაცემთა სტრუქტურები აღმოჩენილი არაა!

source: MACBINARY File Filter
ka: MACBINARY ფაილის ფილტრი

source: MacBinary images (*.bin, *.macbin)
ka: MacBinary ასლის ფაილები (*.bin, *.macbin)

source: Filter cannot handle given data: .BIN files are not supported.
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: .BIN ფაილები მხარდაჭერილი არაა.

source: Filter cannot handle given data: failed to open sndfile: %s
ka: ფილტრს მოწოდებული ინფორმაციის დამუშავება არ შეუძლია: sndfile-ის გახსნის შეცდომა: %s

source: Audio file is not seekable!
ka: აუდიოფაილი გადახვევადი არაა!

source: Invalid number of channels in audio file (%d)! Only two-channel audio files are supported!
ka: არხების არასწორი რაოდენობა აუდიოფაილში (%d). მხარდაჭერილია, მხოლოდ, ორარხიანი აუდიოფაილები!

source: Failed to allocate read buffer!
ka: წაკითხვის ბუფერის გამოყოფის შეცდომა!

source: Failed to initialize resampler; error code %d!
ka: რესამპლერის ინიციალიზაცია ჩავარდა. შეცდომის კოდი %d!

source: Failed to allocate resampler output buffer!
ka: რესამლერის გამოტანის ბუფერის გამოყოფა ჩავარდა!

source: Failed to allocate resampler input buffer!
ka: რესამლერის შეყვანის ბუფერის გამოყოფა ჩავარდა!

source: SNDFILE File Filter
ka: SNDFILE ფაილის ფილტრი

source: WAV audio files (*.wav)
ka: WAV აუდიოფაილები (*.wav)

source: AIFF audio files (*.aiff)
ka: AIFF აუდიოფაილები (*.aiff)

source: FLAC audio files (*.flac)
ka: FLAC აუდიოფაილები (*.flac)

source: OGG audio files (*.ogg)
ka: OGG აუდიოფაილები (*.ogg)

source: Failed to (re)allocate read buffer (%d bytes)!
ka: წაკითხვის ბუფერის (%d ბაიტი) (თავიდან) გამოყოფა ჩავარდა!

source: Failed to seek to the beginning of header!
ka: თავსართის დასაწყისსი გადახვევა ჩავარდა!

source: Failed to read stream's header!
ka: ნაკადის თავსართის წაკითხვის შეცდომა!

source: Failed to decode stream's header!
ka: ნაკადის თავსართის დეკოდირების შეცდომა!

source: Failed to seek to the beginning of footer!
ka: ბოლოსართის დასაწყისში გადახვევა ჩავარდა!

source: Failed to read stream's footer!
ka: ნაკადის ბოლოსართის წაკითხვის შეცდომა!

source: Failed to decode stream's footer!
ka: ნაკადის ბოლოსართის დეკოდირების შეცდომა!

source: Stream's header and footer do not match!
ka: ნაკადის თავსართი და ბოლოსართი არ ემთხვევა!

source: Failed to read stream's index!
ka: ნაკადის ინდექსის წაკითხვა ჩავარდა!

source: Failed to decode stream's index!
ka: ნაკადის ინდექსის გაშიფვრის შეცდომა!

source: Declared and actual index size mismatch!
ka: აღწერილი და რეალური ინდექსის ზომა არ ემთხვევა!

source: The largest block (%s bytes) exceeds the limit of %d bytes!
ka: უდიდესი ბლოკი (%s ბაიტი) ზღვარს (%d ბაიტი) აჭარბებს!

source: Failed to allocate block buffer (%d bytes)!
ka: ბლოკის ბუფერის (%d ბაიტი) გამოყოფა ჩავარდა!

source: Filter cannot handle given data: failed to read 6 signature bytes!
ka: ფილტრს მითითებული მონაცემების დამუშავება არ შეუძლია: ხელმოწერის 6 ბაიტის წაკითხვის შეცდომა!

source: XZ File Filter
ka: XZ ფაილის ფილტრი

source: xz-compressed images (*.xz)
ka: xz-ით შეკუმშული ასლის ფაილები (*.xz)

source: BlindWrite 5/6 image file
ka: BlindWrite 5/6 ასლის ფაილი

source: Failed to read whole BWA file!
ka: მთლიანი BWA ფაილის წაკითხვის შეცდომა!

source: Failed to find data file '%s'!
ka: მონაცემების ფაილის '%s' პოვნა შეუძლებელია!

source: Invalid header!
ka: არასწორი თავსართი!

source: Unknown or unhandled disc type 0x%X!
ka: უცნობი, ან დაუმუშავებელი დისკის ტიპი 0x%X!

source: Unknown track type 0x%X!
ka: უცნობი ტრეკის ტიპი 0x%X!

source: Invalid footer!
ka: არასწორი ბოლოსართი!

source: Parser cannot handle given image: failed to read 16 bytes from image file stream!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: ასლის ფაილის ნაკადიდან 16 ბაიტის წაკითხვის შეცდომა!

source: Parser cannot handle given image: invalid signature!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: არასწორი ხელმოწერა!

source: Failed to read whole B6T file!
ka: მთლიანი B6T ფაილის წაკითხვის შეცდომა!

source: B6T Image Parser
ka: B6T ასლის ფაილის დამმუშავებელი

source: BlindWrite 5/6 images (*.b5t, *.b6t)
ka: BlindWrite 5/6 ასლის ფაილები (*.b5t, *.b6t)

source: WinOnCD image file
ka: WinOnCD ასლის ფაილი

source: Failed to read Z info header!
ka: Z ინფორმაციის თავსართის წაკითხვა ჩავარდა!

source: Failed to read Z info!
ka: Z ინფორმაციის წაკითხვა ჩავარდა!

source: Compressed images are not supported yet!
ka: შეკუმშული ასლის ფაილები ჯერ მხარდაჭერილი არაა!

source: Parser cannot handle given image: failed to read signature!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: ხელმოწერის წაკითხვის შეცდომა!

source: Failed to allocate memory for header (%zu bytes)!
ka: თავსართისთვის (%zu ბაიტი) მეხსიერების გამოყოფის შეცდომა!

source: Failed to read header!
ka: თავსართის წაკითხვა ჩავარდა!

source: Failed to allocate memory for descriptor (%d)!
ka: დესკრიპტორისთვის (%d) მეხსიერების გამოყოფის შეცდომა!

source: Failed to read descriptor!
ka: დესკრიპტორის წაკითხვა ჩავარდა!

source: C2D Image Parser
ka: C2D ასლის ფაილის დამმუშავებელი

source: WinOnCD images (*.c2d)
ka: WinOnCD ასლის ფაილები (*.c2d)

source: CloneCD image file
ka: CloneCD ასლის ფაილი

source: ccd_next_entry == NULL; should not happen!
ka: ccd_next_entry == NULL; არ უნდა მომხდარიყო!

source: Failed to get entry with point #%d!
ka: მიღების შეცდომა ჩანაწერისთვის წერტილით #%d!

source: Declared CD-TEXT size (%d) does not match declared number of entries (%d)!
ka: აღწერილი CD-TEXT-ის ზომა (%d) ჩანაწერების აღწერილ რაოდენობას (%d) არ ემთხვევა!

source: Invalid CD-TEXT entry #%d (expecting only %d entries)!
ka: არასწორი CD-TEXT-ის ჩანაწერი #%d (მოველოდი, მხოლოდ, %d ჩანაწერს)!

source: Failed to read line #%d: %s!
ka: წაკითხვის შეცდომა ხაზზე #%d: %s!

source: Parser cannot handle given image: invalid suffix!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: არასწორი სუფიქსი!

source: Could not find main data file!
ka: მთავარი მონაცემთა ფაილის პოვნა შეუძლებელია!

source: Could not find subchannel data file!
ka: ქვეარხის მონაცემთა ფაილის პოვნა შეუძლებელია!

source: CCD Image Parser
ka: CCD ასლის ფაილის დამმუშავებელი

source: CloneCD images (*.ccd)
ka: CloneCD ასლის ფაილები (*.ccd)

source: DiscJuggler image file
ka: DiscJuggler ასლის ფაილები

source: Invalid track mode: %d!
ka: არასწორი ტრეკის რეჟიმი: %d!

source: Invalid read mode: %d!
ka: არასწორი წაკითხვის რეჟიმი: %d!

source: Failed to read descriptor length!
ka: დესკრიპტორის სიგრძის წაკითხვის შეცდომა!

source: CDI Image Parser
ka: CDI ასლის ფაილის დამმუშავებელი

source: DiscJuggler images (*.cdi)
ka: DiscJuggler ასლის ფაილები (*.cdi)

source: Adaptec Easy CD/DVD Creator image file
ka: Adaptec Easy CD/DVD Creator-ის ასლის ფაილი

source: Failed to read sub-block length!
ka: ქვებლოკის სიგრძის წაკითხვის შეცდომა!

source: Sanity check failed!
ka: სისწორის შემოწმება ჩავარდა!

source: Failed to read sub-block data (%d bytes)!
ka: ქვებლოკის მონაცემების (%d ბაიტი) წაკითხვის შეცდომა!

source: Unknown track type (%d)!
ka: უცნობი ტრეკის ტიპი (%d)!

source: Unknown session type (%d)!
ka: უცნობი სესიის ტიპი (%d)!

source: Failed to read number of entries!
ka: ჩანაწერების რაოდენობის წაკითხვის შეცდომა!

source: Failed to read "ofs" entry!
ka: "ofs" ჩანაწერის წაკითხვა ჩავარდა!

source: Invalid FOURCC; expected 'RIFF', got '%.4s'
ka: არსწორი FOURCC. მოველოდი: 'RIFF'. მივიღე:'%.4s'

source: Descriptor does not contain 'disc' block!
ka: დესკრიპტორი ბლოკს 'disc' არ შეიცავს!

source: Descriptor does not contain 'ofs ' block!
ka: დესკრიპტორი ბლოკს 'ofs' არ შეიცავს!

source: Parser cannot handle given image: failed to read header!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: თავსართის წაკითხვის შეცდომა!

source: Parser cannot handle given image: image does not begin with 'RIFF'!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: დისკის ასლის ფაილი 'RIFF'-ით არ იწყება!

source: Parser cannot handle given image: invalid header!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: არასწორი თავსართი!

source: CIF Image Parser
ka: CIF ასლის ფაილის დამმუშავებელი

source: Adaptec Easy CD/DVD Creator images (*.cif)
ka: Adaptec Easy CD/DVD Creator-ის ასლის ფაილები (*.cif)

source: Current track is not set!
ka: მიმდინარე ტრეკი დაყენებული არაა!

source: Finishing last track resulted in negative fragment length!
ka: ბოლო ტრეკის დასრულების შედეგი უარყოფითი ფრაგმენტის სიგრძეა!

source: Current session is not set!
ka: მიმდინარე სესია დაყენებული არაა!

source: Failed to find data file!
ka: მონაცემთა ფაილის პოვნა შეუძლებელია!

source: Invalid track mode string '%s'!
ka: არასწორი ტრეკის რეჟიმის სტრიქონი '%s'!

source: Failed to find CDT file!
ka: CDT ფაილის აღმოჩენის შეცდომა!

source: Failed to read whole CDT file!
ka: მთლიანი CDT ფაილის წაკითხვის შეცდომა!

source: CUE Image Parser
ka: CUE ასლის ფაილის დამმუშავებელი

source: CUE images (*.cue)
ka: CUE ასლის ფაილები (*.cue)

source: Apple Disk image
ka: Apple-ის დისკის ასლის ფაილი

source: Parser cannot handle given image: file too small!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: ფაილი მეტისმეტად დიდია!

source: Failed to seek to ISO signature!
ka: ISO ხელმოწერამდე გადახვევა ჩავარდა!

source: Failed to read ISO signature!
ka: ISO ხელმოწერის წაკითხვა ჩავარდა!

source: Image is an ISO image - deferring!
ka: ასლის ფაილი ISO ფაილია - გამოტოვება!

source: Failed to seek to beginning of file!
ka: ფაილის დასაწყისში გადახვევა ჩავარდა!

source: Failed to read driver descriptor map!
ka: დრაივერის დესკრიპტორების სიის წაკითხვის შეცდომა!

source: Failed to seek to beginning of APM entries!
ka: APM ჩანაწერების დასაწყისში გადახვევის შეცდომა!

source: Failed to read APM entry!
ka: APM ჩანაწერის წაკითხვა ჩავარდა!

source: Parser cannot map this sector size!
ka: დამმუშავებელს ამ სექტორის ზომის ასახვა არ შეუძლია!

source: Failed to seek to GPT header!
ka: GPT თავსართამდე გადახვევა ჩავარდა!

source: Failed to read GPT header!
ka: GPT თავსართის წაკითხვა ჩავარდა!

source: Failed to seek to beginning of GPT entries!
ka: GPT ჩანაწერების დასაწყისში გადახვევა ჩავარდა!

source: Failed to read GPT entry!
ka: GPT ჩანაწერის წაკითხვა ჩავარდა!

source: Failed to seek to Master Directory Block (MDB)!
ka: ძირითადი საქაღალდის ბლოკამდე (MDB) გადახვევა ჩავარდა!

source: Failed to read Master Directory Block (MDB)!
ka: ძირითადი საქაღალდის ბლოკის (MDB) წაკითხვა ჩავარდა!

source: Parser cannot handle given image!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება!

source: Hard-disk Image Parser
ka: მყარი დისკის ასლის ფაილის დამმუშავებელი

source: Apple Disk image (*.cdr)
ka: Apple-ის ასლის ფაილი (*.cdr)

source: Apple Disk image (*.smi)
ka: Apple-ის ასლის ფაილი (*.smi)

source: Apple Disk image (*.img)
ka: Apple-ის ასლის ფაილი (*.img)

source: Failed to seek to %s to read %d bytes of data!
ka: %s-მდე გადახვევა %d ბაიტი მონაცემების წასაკითხად შეუძლებელია!

source: Failed to read %d bytes of data!
ka: %d ბაიტი მონაცემების წაკითხვა ჩავარდა!

source: Parser cannot handle given image: file is too small!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: ფაილი მეტისმეტად პატარაა!

source: Parser cannot handle given image: file size does not correspond to any supported combination of sector and subchannel size!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: ფაილის ზომა არ შეესაბამება არცერთ სექტორებისა და ქვეარხის ზომის კომბინაციას!

source: Unhalded main sector data size %d!
ka: მხარდაუჭერელი მთავარი სექტორის მონაცემთა ზომა %d!

source: Unhalded subchannel data size %d!
ka: მხარდაუჭერელი ქვეარხის მონაცემთა ზომა %d!

source: ISO Image Parser
ka: ISO ასლის ფაილის დამმუშავებელი

source: ISO images (*.iso, *.bin, *.img)
ka: ISO ასლის ფაილები (*.iso, *.bin, *.img)

source: GameCube ISO images (*.iso
ka: GameCube ISO ასლის ფაილები (*.iso

source: Wii ISO images (*.iso)
ka: Wii ISO ასლის ფაილები (*.iso)

source: ISO Image Writer
ka: ISO ასლის ჩამწერი

source: Audio file suffix
ka: აუდიოფაილის სუფიქსი

source: Suffix to use for image files of audio tracks. Applicable only when in raw write is disabled.
ka: სუფიქსი აუდიოტრეკების ასლის ფაილისთვის. მუშაობს, მხოლოდ, მაშინ, როცა დაუმუშავებელი ჩაწერა გამორთულია.

source: Write raw
ka: დაუმუშავებლის ჩაწერა

source: A flag indicating whether to write full 2352-byte sector data or only user data part of it (e.g., 2048 bytes for Mode 1)
ka: ალამი, რომელიც მიუთითებს, ჩაიწერება სრული 2352-ბაიტიანი სექტორის მონაცემები, ან, მხოლოდ მომხმარებლის მონაცემები ნაწილი (მაგ: 0248 ბაიტი 1 რეჟიმისთვის)

source: Write subchannel
ka: ქვეარხის ჩაწერა

source: A flag indicating whether to write subchannel data or not. If set, it implies raw writing.
ka: ალამი, რომელიც მიუთითებს, მოხდება ქვეარხის მონაცემების ჩაწერა, თუ არა. თუ დაყენებულია, ის გულისხმობს დაუმუშავებელ ჩაწერას.

source: Swap raw audio data
ka: დაუმუშავებელი აუდიომონაცემების წინასწარი ჩატვირთვა

source: A flag indicating whether to swap audio data. Applicable only to raw writing.
ka: ალამი, რომელიც მიუთითებს, მოხდება აუდიომონაცემების წინასწარი ჩატვირთვა, თუ არა. გამოიყენება, მხოლოდ, დაუმუშავებელი ჩაწერისას.

source: Alcohol 120% image file (*.mds)
ka: Alcohol 120% ასლის ფაილი (*.mds)

source: GameJack image file (*.xmd)
ka: GameJack ასლის ფაილი (*.xmd)

source: Track block does not have a footer!
ka: ტრეკის ბლოკს ბოლოსართი არ აქვს!

source: Parser cannot handle given image: failed to read signature and version!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: ხელმოწერისა და ვერსიის წაკითხვის შეცდომა!

source: Parser cannot handle given image: invalid signature and/or version!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: არასწორი ხელმოწერა ან/და ვერსია!

source: Failed to read whole MDS file!
ka: მთლიანი MDS ფაილის წაკითხვის შეცდომა!

source: Medium of type 0x%X not supported yet!
ka: მედია ტიპით 0x%X ჯერ მხარდაჭერილი არაა!

source: MDS Image Parser
ka: MDS ასლის ფაილის დამმუშავებელი

source: Alchohol 120% images (*.mds)
ka: Alchohol 120% ასლის ფაილები (*.mds)

source: GameJack images (*.xmd)
ka: GameJack ასლის ფაილები (*.xmd)

source: DaemonTools image file
ka: DaemonTools-ის ასლის ფაილი

source: Unsupported track mode!
ka: მხარდაუჭერელი ტრეკის რეჟიმი!

source: Unsupported subchannel data type (%d)!
ka: მხარდაუჭერელი ქვეარხის მონაცემთა ტიპი (%d)!

source: Track sector size mismatch!
ka: ტრეკის სექტორის ზომა არ ემთხვევა!

source: Track has no footer blocks!
ka: ტრეკს ბოლოსართის ბლოკები არ აქვს!

source: Zero-valued filename offset found in footer block!
ka: ბოლოსართის ბლოკში აღმოჩენილია ნულოვანი მნიშვნელობის ფაილის სახელის წანაცვლება!
