Repository: cdemu/cdemu
Catalog: libmirage/po/*.po
Languages: ka

source: Failed to set up MDX data fragment: %s!
ka: MDX მონაცემთა ფრაგმენტის მორგება შეუძლებელია: %s!

source: Track length validation failed for track #%d!
ka: ტრეკის სიგრძის გადამოწმება ჩავარდა ტრეკისთვის #%d!

source: CD-TEXT data length (%d) is not a multiple of 18!
ka: CD-TEXT-ის მონაცემების სიგრძე (%d) 18-ის ნამრავლი არაა!

source: CD-TEXT is currently supported only with single-session disc images!
ka: CD-TEXT ამჟამად, მხოლოდ, ერთსესიიანი დისკის ასლის ფაილებთანაა ხელმისაწვდომი!

source: Failed to parse sessions: %s
ka: სესიების დამუშავების შეცდომა: %s

source: Failed to read MDX footer offset!
ka: MDX ბოლოსართის წანაცვლების წაკითხვის შეცდომა!

source: Failed to read MDX footer length!
ka: MDX ბოლოსართის სიგრძის წაკითხვის შეცდომა!

source: Failed to seek to encryption header offset!
ka: დაშიფვრის თავსართის წანაცვლებამდე გადახვევა შეუძლებელია!

source: Failed to read encryption header!
ka: დაშიფვრის თავსართის წაკითხვა ჩავარდა!

source: Failed to decipher encryption header: %s!
ka: დაშიფვრის თავსართის გაშიფვრა ჩავარდა: %s!

source: Sanity check on descriptor size failed!
ka: დესკრიპტორის ზომაზე მთლიანობის შემოწმება ჩავარდა!

source: Failed to allocate read buffer for descriptor data!
ka: დესკრიპტორის მონაცემებისთვის წაკითხვის ბუფერის გამოყოფის შეცდომა!

source: Failed to read all descriptor data!
ka: ყველა დესკრიპტორის მონაცემების წაკითხვის შეცდომა!

source: Failed to decipher/decompress descriptor data: %s!
ka: დესკრიპტორის მონაცემების გაშიფვრის/დეკომპრესიის შეცდომა: %s!

source: Unexpected size of encryption header for image data!
ka: დაშიფვრის თავსართის მოულოდნელი ზომა ასლის ფაილების მონაცემებისთვის!

source: Failed to allocate buffer!
ka: ბუფერის გამოყოფის შეცდომა!

source: Failed to decipher encryption header for image data! Incorrect password?
ka: ასლის ფაილის მონაცემებისთვის დაშიფვრის თავსართის გაშიფვრა ჩავარდა! არასწორი პაროლი?

source: Parser cannot handle given image: failed to read MDX/MDSv2 header!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: MDX/MDSv2 თავსართის წაკითხვის შეცდომა!

source: Installed version of libgcrypt (%s) does not satisfy minimum requirement (%s)!
ka: libgcrypt-ის დაყენებული ვერსია (%s) მინიმალურ მოთხოვნას (%s) არ აკმაყოფილებს!

source: MDX Image Parser
ka: MDX ასლის ფაილის დამმუშავებელი

source: DaemonTools images (*.mdx, *.mds)
ka: DaemonTools-ის ასლის ფაილები (*.mdx, *.mds)

source: Failed to allocate memory for block index!
ka: ბლოკის ინდექსისთვის მეხსიერების გამოყოფა ჩავარდა!

source: Failed to look up 'MTYP' block!
ka: 'MTYP' ბლოკის მოძებნის შეცდომა!

source: Unhandled medium type: %d!
ka: დაუმუშავებელი მედიის ტიპი: %d!

source: Failed to look up 'ETN2' or 'ETNF' block!
ka: 'ETN2' ან 'ETNF' ბლოკის მოძებნის შეცდომა!

source: Failed to allocate space for ETN blocks!
ka: ETN ბლოკებისთვის სივრცის გამოყოფა ჩავარდა!

source: Failed to look up 'CUEX' or 'CUES' block!
ka: 'CUEX' ან 'CUES' ბლოკის მოძებნის შეცდომა!

source: Failed to allocate memory for CUE blocks!
ka: CUE ბლოკებისთვის მეხსიერების გამოყოფა ჩავარდა!

source: Failed to look up 'DAOX' or 'DAOI' block!
ka: 'DAOX' ან 'DAOI' ბლოკის მოძებნის შეცდომა!

source: Failed to allocate space for DAO header!
ka: DAO თავსართისთვის სივრცის გამოყოფა ჩავარდა!

source: Failed to look up 'CDTX' block!
ka: 'CDTX' ბლოკის მოძებნის შეცდომა!

source: Failed to read trailer offset!
ka: ბოლო წანაცვლების წაკითხვის შეცდომა!

source: Failed to seek to trailer offset (32-bit)!
ka: ბოლო წანაცვლებამდე (32-ბიტიანი) გადახვევის შეცდომა!

source: nrg_data_length must be greater than 0!
ka: nrg_data_length 0-ზე მეტი უნდა იყოს!

source: NRG Image Parser
ka: NRG ასლის ფაილის დამმუშავებელი

source: Nero Burning Rom images (*.nrg)
ka: Nero Burning Rom-ის ასლის ფაილები (*.nrg)

source: Nero Burning ROM image file
ka: Nero Burning ROM ასლის ფაილი

source: Parser cannot handle given image: failed to read 2-byte TOC length!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: 2-ბაიტიანი TOC-ის სიგრძის წაკითხვის შეცდომა!

source: Data file not found!
ka: მონაცემთა ფაილი აღმოჩენილი არაა!

source: Failed to create stream on data file!
ka: მონაცემთა ფაილზე ნაკადის შექმნა ჩავარდა!

source: Failed to read whole TOC file!
ka: მთლიანი TOC ფაილის წაკითხვის შეცდომა!

source: READCD Image Parser
ka: READCD ასლის ფაილის დამმუშავებელი

source: readcd images (*.toc)
ka: readcd-ის ასლის ფაილები (*.toc)

source: Parser cannot handle given image: invalid TOC file!
ka: დამმუშავებელს არ შეუძლია მიწოდებული ასლის ფაილის დამუშავება: არასწორი TOC ფაილი!

source: TOC Image Parser
ka: TOC ასლის ფაილის დამმუშავებელი

source: cdrdao images (*.toc)
ka: cdrdao-ის ასლის ფაილები (*.toc)

source: Unsupported medium format!
ka: მხარდაუჭერელი მედიის ფორმატი!

source: TOC Image Writer
ka: TOC ასლის ფაილების ჩამწერი

source: X-CD-Roast Image Parser
ka: X-CD-Roast ასლის ფაილის დამმუშავებელი

source: X-CD-Roast images (*.toc)
ka: X-CD-Roast-ის ასლის ფაილები (*.toc)

source: X-CD Roast image file
ka: X-CD Roast ასლის ფაილი

source: Invalid block number #%i!
ka: არასწორი ბლოკის ნომერი #%i!

source: Block number %d exceeds number of blocks %d!
ka: ბლოკის ნომერი %d მეტია, ვიდრე ბლოკების რაოდენობა %d!

source: Requested block %d has no language code set!
ka: მოთხოვნილ ბლოკს %d ენის კოდი დაყენებული არ აქვს!

source: Context does not have a password function!
ka: კონტექსტს პაროლის ფუნქცია არ აქვს!

source: Password has not been provided!
ka: პაროლი მოწოდებული არაა!

source: No image files given!
ka: ასლის ფაილები გადაცემული არაა!

source: No parser can handle the image file!
ka: ასლის ფაილის დამუშავება არცერთ დამმუშავებელს შეუძლია!

source: Failed to open read-only file stream on data file: %s!
ka: მონაცემთა ფაილზე მხოლოდ-წაკითხვადი ფაილის ნაკადის გახსნის შეცდომა: %s!

source: Failed to open read-write file stream on data file: %s!
ka: მონაცემთა ფაილზე ჩაწერად-წაკითხვადი ფაილის ნაკადის გახსნის შეცდომა: %s!

source: Invalid filter type '%s' in filter chain!
ka: არასწორი ფილტრის ტიპი '%s' ფილტრების ჯაჭვში!

source: Failed to create filter type '%s': %s!
ka: შექმნის შეცდომა ფილტრის ტიპისტვის '%s'; %s!

source: Context not set!
ka: კონტექსტი დაყენებული არაა!

source: Session with number %d already exists!
ka: სესია ნომრით %d უკვე არსებობს!

source: Session index %d out of range!
ka: სესიის ინდექსი %d შუალედს გარეთაა!

source: Session with index %d not found!
ka: სესია ინდექსით %d აღმოჩენილი არაა!

source: Session with number %d not found!
ka: სესია ნომრით %d აღმოჩენილი არაა!

source: Session address %d (0x%X) out of range!
ka: სესიის მისამართი %d (0x%X) შუალედს გარეთაა!

source: Session containing address %d not found!
ka: სესია, რომელიც შეიცავს მისამართს %d აღმოჩენილი არაა!

source: Session with track %d not found!
ka: სესია ტრეკით %d აღმოჩენილი არაა!

source: Session %p is not in disc layout!
ka: სესია %p დისკის განლაგებაში არაა!

source: Session before session %p not found!
ka: სესია სესიამდე %p აღმოჩენილი არაა!

source: Session after session %p not found!
ka: სესია სესიის %p შემდეგ აღმოჩენილი არაა!

source: Session not found!
ka: სესია ვერ ვიპოვე!

source: Track has no parent!
ka: ტრეკს მშობელი არ გააჩნია!

source: Invalid track number %d!
ka: არასწორი ტრეკის ნომერი %d!

source: Track index %d out of range!
ka: ტრეკი ინდექსით %d შუალედს გარეთაა!

source: Track with index %d not found!
ka: ტრეკი ინდექსით %d აღმოჩენილი არაა!

source: Invalid medium type!
ka: არასწორი მედიის ტიპი!

source: Invalid layer %d!
ka: არასწორი ფენა %d!

source: Disc structure data not provided!
ka: დისკის სტრუქტურის მონაცემები მოწოდებული არაა!

source: DPM data not available!
ka: DPM მონაცემები ხელმისაწვდომი არაა!

source: Sector address %d out of range!
ka: სექტორი მისამართით %d შუალედს გარეთაა!

source: File '%s' does not exist!
ka: ფაილი '%s' არ არსებობს!

source: Failed to open file %s stream on data file '%s': %s!
ka: ფაილის %s ნაკადის გახსნის შეცდომა მონაცემთა ფაილზე '%s': %s!

source: input/output
ka: შეტანა/გამოტანა

source: input
ka: შეყვანა

source: No file input stream!
ka: შეყვანის ნაკადის გარეშე!

source: No file output stream!
ka: გამოტანის ნაკადის გარეშე!

source: No file stream!
ka: ფაილის ნაკადის გარეშე!

source: Cannot move file for non-writable stream!
ka: ფაილის გადატანა არაჩაწერადი ნაკადისთვის შეუძლებელია!

source: Failed to move file: %s
ka: ფაილის გადაადგილების შეცდომა: %s

source: Failed to re-open moved file: %s
ka: გადატანილი ფაილის თავიდან გახსნა ჩავარდა: %s

source: No underlying stream!
ka: ქვედა ნაკადის გარეშე!

source: Simplified partial read function is not implemented!
ka: გამარტივებული ნაწილობრივი წაკითხვის ფუნქცია განხორციელებული არაა!

source: Failed to do a partial read.
ka: ნაწილობრივი ჩაწერის შესრულება ჩავარდა.

source: Stream is not writable!
ka: ნაკადი ჩაწერადი არაა!

source: Simplified partial write function is not implemented!
ka: გამარტივებული ნაწილობრივი ჩაწერის ფუნქცია განხორციელებული არაა!

source: Failed to do a partial write.
ka: ნაწილობრივი ჩაწერის შესრულება ჩავარდა.

source: Invalid seek type.
ka: არასწორი გადახვევის ტიპი.

source: Seek before beginning of file not allowed!
ka: ფაილის დასაწყისამდე გადახვევა დაშვებული არაა!

source: Main channel data input stream not set!
ka: მთავარი არხის მონაცემთა შეყვანის ნაკადი დაყენებული არაა!

source: Failed to seek to the end of main channel data input stream: %s
ka: მთავარი არხის მონაცემთა შეყვანის ნაკადის ბოლოში გადახვევის შეცდომა: %s

source: Mismatch between given data (%d) and set main channel data size (%d)!
ka: მოწოდებულ მონაცემებისა (%d) და დაყენებული მთავარი არხის მონაცემების ზომა (%d) არ ემთხვევა!

source: Failed to seek to position %s
ka: გადახვევის შეცდომა პოზიციამდე %s

source: Failed to write data: %s
ka: მონაცემთა ჩაწერა ჩავარდა: %s

source: Mismatch between given data (%d) and accepted subchannel size (%d)!
ka: მოწოდებულ მონაცემებისა (%d) და მოწოდებული ქვეარხის ზომა (%d) არ ემთხვევა!

source: Failed to seek to position %s!
ka: გადახვევის შეცდომა პოზიციამდე %s!

source: Invalid pack type %d!
ka: არასწორი პაკეტის ტიპი %d!

source: Data not set for pack type %d!
ka: პაკეტის ტიპისთვის %d მონაცემები დაყენებული არაა!

source: Failed to open plugin directory '%s'!
ka: გახსნის შეცდომა დამატებების საქაღალდისთვის '%s'!

source: Library not initialized!
ka: ბიბლიოთეკა ინიციალიზებული არაა!

source: Iteration has been cancelled!
ka: იტერაცია გაუქმდა!

source: Writer '%s' not found!
ka: ჩამწერი '%s' აღმოჩენილი არაა!

source: Failed to create data stream!
ka: მონაცემთა ნაკადის შექმნა ჩავარდა!

source: Sync pattern not available for sector type %d!
ka: სინქრონიზაციის ნიმუში ხელმიუწვდომელია სექტორის ტიპისთვის %d!

source: Header not available for sector type %d!
ka: თავსართი ხელმისაწვდომი არაა სექტორის ტიპისთვის %d!

source: Subheader not available for sector type %d!
ka: ქვეთავსართი ხელმისაწვდომი არაა სექტორის ტიპისთვის %d!

source: Data not available for sector type %d!
ka: მონაცემები ხელმისაწვდომი არაა სექტორის ტიპისთვის %d!

source: EDC/ECC not available for sector type %d!
ka: EDC/ECC ხელმისაწვდომი არაა სექტორის ტიპისთვის %d!

source: Unhandled sector size %d for Audio sector!
ka: დაუმუშავებელი სექტორის ზომა %d აუდიოს სექტორისთვის!

source: Unhandled sector size %d for Mode 0 sector!
ka: დაუმუშავებელი სექტორის ზომა %d 0 რეჟიმის სექტორისთვის!

source: Unhandled sector size %d for Mode 1 sector!
ka: დაუმუშავებელი სექტორის ზომა %d 1 რეჟიმის სექტორისთვის!

source: Unhandled sector size %d for Mode 2 Formless sector!
ka: დაუმუშავებელი სექტორის ზომა %d 2 რეჟიმის უფორმო სექტორისთვის!

source: Unhandled sector size %d for Mode 2 Form 1 sector!
ka: დაუმუშავებელი სექტორის ზომა %d 2 რეჟიმის 1 ფორმის სექტორისთვის!

source: Unhandled sector size %d for Mode 2 Form 2 sector!
ka: დაუმუშავებელი სექტორის ზომა %d 2 რეჟიმის 2 ფორმის სექტორისთვის!

source: Unhandled sector size %d for Mode 2 Mixed sector!
ka: დაუმუშავებელი სექტორის ზომა %d 2 რეჟიმის შერეული სექტორისთვის!

source: Raw sectors require 2352 bytes of data!
ka: დაუმუშავებელი სექტორები ითხოვენ 2352 ბაიტ მონაცემებს!

source: Requested subchannel size (%d) and actual subchannel size (%d) mismatch!
ka: მოთხოვნილი ქვეარხის ზომა (%d) და მიმდინარე ქვეარხის ზომა (%d) არ ემთხვევა!

source: Expected %d bytes for sync pattern!
ka: მოველოდი %d ბაიტს სინქრონიზაციის ნიმუშისთვის!

source: Expected %d bytes for header!
ka: მოველოდი %d ბაიტს თავსართისთვის!

source: Expected %d bytes for subheader!
ka: მოველოდი %d ბაიტს ქვეთავსართისთვის!

source: Expected %d bytes for data!
ka: მოველოდი %d ბაიტს მონაცემებისთვის!

source: Expected %d bytes for EDC/ECC!
ka: მოველოდი %d ბაიტს EDC/ECC-ისთვის!

source: Subchannel format %d not supported yet!
ka: ქვეარხის ფორმატი %d ჯერ მხარდაჭერილი არაა!

source: Expected 96 bytes for PW subchannel!
ka: მოველოდი 96 ბაიტს PW ქვეარხისთვის!

source: Expected 16 bytes for Q subchannel!
ka: მოველოდი 16 ბაიტს Q ქვეარხისთვის!

source: Track with number %d already exists!
ka: ტრეკი ნომრით %d უკვე არსებობს!

source: Track with number %d not found!
ka: ტრეკი ნომრით %d აღმოჩენილი არაა!

source: Track address %d out of range!
ka: ტრეკის მისამართი %d შუალედს გარეთაა!

source: Track containing address %d not found!
ka: ტრეკი, რომელიც შეიცავს მისამართს %d აღმოჩენილი არაა!

source: Track %p is not in session layout!
ka: ტრეკი %p დისკის განლაგებაში არაა!

source: Track before track %p not found!
ka: ტრეკი ტრეკამდე %p აღმოჩენილი არაა!

source: Track after track %p not found!
ka: ტრეკი ტრეკის %p შემდეგ აღმოჩენილი არაა!

source: Language with language code %d already exists!
ka: ენა ენის კოდით %d უკვე არსებობს!

source: Invalid language index %d!
ka: არასწორი ენის ინდექსი %d!

source: Language with index %d not found!
ka: ენა ინდექსით %d აღმოჩენილი არაა!

source: Language with language code %d not found!
ka: ენა ენის კოდით %d აღმოჩენილი არაა!

source: Failed to decode CD-TEXT data!
ka: CD-TEXT-ის მონაცემების გაშიფვრა ჩავარდა!

source: Session is not in disc layout!
ka: სესია დისკის განლაგებაში არაა!

source: Sector address out of range!
ka: სექტორის მისამართი შუალედს გარეთაა!

source: Failed to get fragment to feed sector: %s
ka: სექტორის შესავსებად ფაქტორის მიღების შეცდომა: %s

source: Failed read main channel data: %s
ka: მთავარი არხის მონაცემთა წაკითხვის შეცდომა: %s

source: Failed to read subchannel data: %s
ka: ქვეარხის მონაცემების წაკითხვის შეცდომა: %s

source: Failed to feed data: %s
ka: მონაცემების შევსების შეცდომა: %s

source: Cannot append sector to track that is not last in the layout!
ka: სექტორის იმ ტრეკის ბოლოში მიწერა, რომელიც განლაგებაში ბოლო არაა, შეუძლებელია!

source: Failed to get last fragment to append sector: %s
ka: სექტორისთვის ბოლოში მისაწერად ბოლო ფრაგმენტის მიღება ჩავარდა: %s

source: Failed to get fragment to write sector: %s
ka: სექტორის ჩასაწერად ფრაგმენტის მიღების შეცდომა: %s

source: Failed to extract data from sector: %s
ka: სექტორიდან მონაცემების ამოღების შეცდომა: %s

source: Failed write main channel data: %s
ka: მთავარი არხის მონაცემების ჩაწერის შეცდომა: %s

source: Failed to write subchannel data: %s
ka: ქვეარხის მონაცემების ჩაწერის შეცდომა: %s

source: Fragment index %d out of range!
ka: ფრაგმენტის ინდექსი %d შუალედს გარეთაა!

source: Fragment with index %d not found!
ka: ფრაგმენტის ინდექსი %d აღმოჩენილი არაა!

source: Fragment with address %d not found!
ka: ფრაგმენტის მისამართით %d აღმოჩენილი არაა!

source: No fragment with subchannel found!
ka: ქვეარხის მქონე ფრაგმენტები აღმოჩენილი არაა!

source: Invalid index start address (%d); before track start!
ka: არასწორი ინდექსის დაწყების მისამართი (%d) ტრეკის დასაწყისამდე!

source: Index number %d out of range!
ka: ინდექსის ნომერი %d შუალედს გარეთაა!

source: Index with number %d not found!
ka: ინდექსი ნომრით %d აღმოჩენილი არაა!

source: Index with address %d not found!
ka: ინდექსი მისამართით %d აღმოჩენილი არა!

source: Language index %d out of range!
ka: ენის ინდექსი %d შუალედს გარეთაა!

source: Track is not in session layout!
ka: ტრეკი სესიის განლაგებაში არაა!

source: Parameter '%s' has invalid type (expected '%s', got '%s')!
ka: პარამეტრს '%s' აქვს არასწორი ტიპი (მოველოდი: '%s'. მივიღე: '%s')!

source: Parameter '%s' has invalid value!
ka: პარამეტრის '%s' მნიშვნელობა არასწორია!
