Repository: cdemu/cdemu
Catalog: cdemu-client/po/*.po
Languages: fr

source: Failed to load configuration from file '%s': %s
fr: Échec de chargement de la configuration depuis le fichier: %s

source: Unknown option
fr: Option inconnue

source: Failed to connect to daemon (bus: '%s')!
fr: Échec de connection au daemon (bus: '%s')!

source: Unknown command: %s
fr: Commande inconnue: %s

source: Failed to get number of devices: %s
fr: Impossible d'obtenir le nombre de périphériques: %s

source: Failed to get status of device %i: %s
fr: Impossible d'obtenir le status du périphérique %i: %s

source: Failed to load image: %s
fr: Échec du chargement de l'image: %s

source: No empty device found
fr: Aucun périphérique vide trouvé

source: Failed to unload device %i: %s
fr: Échec de vidage du périphérique %i: %s

source: Devices' status:
fr: Status des périphériques:

source: LOADED
fr: VIDÉ

source: FILENAME
fr: NOM DE FICHIER

source: Device mapping:
fr: Mapping de périphérique:

source: SCSI CD-ROM
fr: CD-ROM SCSI

source: SCSI generic
fr: générique SCSI

source: Failed to get device mapping of device %i: %s
fr: Impossible d'obtenir le mapping du périphérique %i: %s

source: Devices' daemon debug masks:
fr: Masques de déboguage du daemon des périphériques:

source: DEBUG MASK
fr: MASQUE DE DÉBOGUAGE

source: Failed to get daemon debug mask of device %i: %s
fr: Impossible d'obtenir le masque de déboguage du daemon pour le périphérique %i: %s

source: Daemon debug mask of device %i: 0x%X
fr: Masque de déboguage du daemon pour le périphérique %i: 0x%X

source: Setting daemon debug mask of all devices to 0x%X.
fr: Mettre le masque de déboguage du daemon de tous les périphériques à 0x%X

source: Failed to set daemon debug mask of device %i to 0x%X: %s
fr: Impossible de mettre le masque de déboguage du daemon pour le périphérique %i à 0x%X: %s

source: Setting daemon debug mask of device %i to 0x%X.
fr: Mettre le masque de déboguage du daemon du périphérique %i à 0x%X.

source: Devices' library debug masks:
fr: Masques de déboguage de la bibliothèque de fonctions pour les périphériques:

source: Failed to get library debug mask of device %i: %s
fr: Impossible d'obtenir le masque de déboguage de la bibliothèque de fonctions pour le périphérique %i: %s

source: Library debug mask of device %i: 0x%X
fr: Masque de déboguage de la bibliothèque de fonctions pour le périphérique %i: 0x%X

source: Setting library debug mask of all devices to 0x%X.
fr: Mettre le masque de déboguage de la bibliothèque de fonctions pour tous les périphériques à 0x%X.

source: Failed to set library debug mask of device %i to 0x%X: %s
fr: Impossible de mettre le masque de déboguage de la bibliothèque de fonctions pour le périphérique %i à 0c%X: %s

source: Setting library debug mask of device %i to 0x%X.
fr: Application du masque de déboguage de la bibliothèque de fonctions du périphérique %i à 0x%X

source: Devices' DPM emulation flag:
fr: Choix de l'émulation DPM de tous les périphériques:

source: ENABLED
fr: ACTIVÉ

source: Failed to get DPM emulation flag of device %i: %s
fr: Impossible d'obtenir le paramètre pour l'émulation DPM du périphérique %i: %s

source: DPM emulation flag of device %i: %i
fr: Choix de l'émulation DPM du périphérique %i: %i

source: Setting DPM emulation flag of all devices to %i.
fr: Application du choix de l'émulation DPM de tous les périphériques à %i

source: Failed to set DPM emulation flag of device %i to %i: %s
fr: Impossible de mettre le choix de l'émulation DPM du périphérique %i à %i: %s

source: Setting DPM emulation flag of device %i to %i.
fr: Application du choix de l'émulation DPM du périphérique %i à %i

source: Devices' transfer rate emulation flag:
fr: Choix de l'émulation de taux de transfert de tous les périphériques :

source: Failed to get transfer rate emulation flag of device %i: %s
fr: Impossible d'obtenir le paramètre pour l'émulation de taux de transfert du périphérique %i: '%s'

source: Transfer rate emulation flag of device %i: %i
fr: Choix de l'émulation de taux de transfert du périphérique %i: %i

source: Setting transfer rate emulation flag of all devices to %i.
fr: Application du choix de l'émulation de taux de transfert de tous les périphériques à %i.

source: Failed to set transfer rate emulation flag of device %i to %i: %s
fr: Impossible de mettre le choix de l'émulation de taux de transfert du périphérique %i à %i: %s

source: Setting transfer rate emulation flag of device %i to %i.
fr: Application du choix de l'émulation de taux de transfert du périphérique %i à %i

source: Devices' IDs:
fr: IDs DE PÉRIPHÉRIQUES:

source: DEVICE ID
fr: ID DE PÉRIPHÉRIQUE

source: Failed to get device ID of device %i: %s
fr: Impossible d'obtenir l'ID de périphérique du périphérique %i: %s

source: Device ID of device %i: %s
fr: ID de périphérique du périphérique %i: %s

source: Setting device ID of all devices to %s.
fr: Mettre l'ID de périphérique de tous les périphériques à %s

source: Failed to set device ID of device %i to %s: %s
fr: Impossible de mettre l'ID de périphérique du périphérique &i à %s: %s

source: Setting device ID of device %i to %s.
fr: Mettre l'ID de périphérique du périphérique %i à %s.

source: Failed to enumerate supported parsers: %s
fr: Impossible d'énumérer les parsers supportés: %s

source: Supported parsers:
fr: Parsers supportés:

source: Parser information: '%s'
fr: Information de parser: '%s'

source: - Name: %s
fr: - Nom: %s

source: - Author: %s
fr: - Auteur: %s

source: - Multiple files support: %i
fr: - Support des fichiers multiples: %i

source: - Image files description: %s
fr: - Description des fichiers image: %s

source: - Image files suffixes:
fr: - Suffixes des fichiers image:

source: Parser with ID '%s' not found!
fr: Parser avec l'ID '%s' non trouvé!

source: Failed to enumerate supported fragments: %s
fr: Impossible d'énumérer les fragments supportés: %s

source: Supported fragments:
fr: Fragments supportés:

source: Fragment information: '%s'
fr: Informations du fragment: '%s'

source: - Data files suffixes:
fr: - suffixes de fichiers de données:

source: Fragment with ID '%s' not found!
fr: Fragment avec l'ID '%s' non trouvés!

source: Failed to enumerate supported daemon debug masks: %s
fr: Impossible d'énumérer les masques de déboguage du daemon supportés: %s

source: Supported daemon debug masks:
fr: Masques de déboguage du daemon supportés:

source: Failed to enumerate supported library debug masks: %s
fr: Impossible d'énumérer les masques de déboguage de la bibliothèque de fonctions supportés: %s

source: Supported library debug masks:
fr: Masques de déboguage de la bibliothèque de fonctions supportés:

source: Failed to get library version: %s
fr: Impossible d'obtenir la version de la bibliothèque de fonctions: %s

source: Failed to get daemon version: %s
fr: Impossible d'obtenir la version du daemon: %s

source: Library version: %s
fr: Version de la bibliothèque de fonctions: %s

source: Daemon version: %s
fr: Version du daemon: %s

source: Invalid bus parameter '%s', using default!
fr: Paramètre de bus '%s' invalide, choix du paramètre par défaut

source: Failed to connect to CDEmu daemon: %s
fr: Échec de la connection au daemon CDEmu: %s

source: CDEmu daemon version %s detected, but at least version %s is required!
fr: Version %s du daemon CDEmu détectée, mais la version %s minimum est requise!

source: Usage: %s %s %s
fr: Utilisation: %s %s %s

source: Usage: %s [options] <command> <command parameters>
fr: Utilisation: %s [options] <commande> <paramètres de commande>

source: Commands:
fr: Commandes:

source: displays help message
fr: affiche le message d'aide

source: displays program version
fr: affiche la version du programme

source: sets D-BUS bus type to use; valid values are 'session' and 'system'
fr: définit le type de bus D-BUS à utiliser; les valeurs possibles sont 'session' et 'system'

source: Invalid number of parameters for command '%s'!
fr: Nombre de paramètres invalide pour la commande '%s'!

source: ERROR: %s
fr: ERREUR: %s

source: WARNING: %s
fr: ATTENTION: %s

source: <device> <image file> [...]
fr: <périphérique> <fichier image> [...]

source: loads the device
fr: charge le périphérique

source: <device>
fr: <périphérique>

source: unloads the device
fr: vide le périphérique

source: displays the devices' status
fr: affiche le status des périphériques

source: displays the device mapping information
fr: affiche les information du mapping des périphériques

source: <device> [new value]
fr: <périphérique> [nouvelle value]

source: displays/sets daemon debug mask
fr: affiche/définit le masque de déboguage du daemon

source: displays/sets library debug mask
fr: affiche/définit le masque de déboguage de la bibliothèque de fonctions

source: displays/sets DPM emulation flag
fr: affiche/définit le choix de l'émulation DPM

source: displays/sets transfer rate emulation flag
fr: affiche/définit le choix de l'émulation du taux de transfert

source: <device> [new vendor_id] [new product_id] [new revision] [new vendor_specific]
fr: <périphérique> [nouveau vendeur_id] [nouveau produit_id] [nouvelle révision] [nouveau propre_au_vendeur]

source: displays/sets device ID
fr: affiche/définit l'ID du périphérique

source: enumerates supported parsers
fr: énumère les parsers supportés

source: enumerates supported fragments
fr: énumère les fragments supportés

source: enumerates valid daemon debug masks
fr: énumère les masques de déboguage valides pour le daemon

source: enumerates valid library debug masks
fr: énumère les masques de déboguage valides pour la bibliothèque de fonctions

source: displays version information
fr: affiche les informations de version
